tutorials/FF/dambreak/interFoam_monolithic_closed/Fluid1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

// xleft 0;
// xmiddle 0.5;
// xright 1;
//
// ybottom 0;
// ymiddle 0.5;
// ytop 1;
//
// zback 0;
// zmiddle 0.5;
// zfront 1;
//
// rad 0.25;


xleft 0;
xmiddle 2;
xright 4;

ybottom 0;
ymiddle 2.5;
ytop 5;

zback 0;
zmiddle 2.5;
zfront 5;

rad 1;

regions
(
    boxToCell
    {
        box ($xleft $ybottom $zback) ($xright $ymiddle $zfront);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    cylinderToCell
    {

        p1 ($xmiddle $ymiddle $zmiddle);
        p2 ($xmiddle $ytop $zmiddle);
        radius $rad;

        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);


// ************************************************************************* //
